gabrijelokorn/stm32f769DISCO/EmbSys/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
//#include "cmsis_os2.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <stdio.h>
#include <stdbool.h>
#include "stm32f769i_discovery.h"
#include "stm32f769i_discovery_lcd.h"
#include "stm32f769i_discovery_ts.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x2007c000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x2007c0a0
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x2007c000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x2007c0a0))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */
ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */

#endif

ETH_TxPacketConfig TxConfig;

ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

ETH_HandleTypeDef heth;

CEC_HandleTypeDef hcec;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c4;

IWDG_HandleTypeDef hiwdg;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA1;
SAI_HandleTypeDef hsai_BlockB1;
SAI_HandleTypeDef hsai_BlockA2;

MMC_HandleTypeDef hmmc2;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim10;
TIM_HandleTypeDef htim11;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart5;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

PCD_HandleTypeDef hpcd_USB_OTG_HS;

WWDG_HandleTypeDef hwwdg;

SDRAM_HandleTypeDef hsdram1;

#define FIBBIONACI_STACK_CAPACITY 128 * 4
#define WW_STACK_CAPACITY 512 * 4
#define GOL_STACK_CAPACITY 512 * 4

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 4096 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};   uint8_t cec_receive_buffer[16];

osThreadId_t fibonacci_taskHandle;
const osThreadAttr_t fibonacci_Task_attributes = {
		.name = "Fibi",
		.stack_size = FIBBIONACI_STACK_CAPACITY,
		.priority = (osPriority_t) osPriorityNormal,
};
int calculating = 1;

osThreadId_t game_of_life_taskHandle;
const osThreadAttr_t game_of_life_Task_attributes = {
		.name = "Gol",
		.stack_size = GOL_STACK_CAPACITY,
		.priority = (osPriority_t) osPriorityNormal,
};

osThreadId_t wirewolrd_taskHandle;
const osThreadAttr_t wirewolrd_Task_attributes = {
		.name = "Ww",
		.stack_size = WW_STACK_CAPACITY,
		.priority = (osPriority_t) osPriorityNormal,
};

osThreadId_t ww_RED_taskHandle;
const osThreadAttr_t ww_red_Task_attributes = {
		.name = "ww_red",
		.stack_size = WW_STACK_CAPACITY,
		.priority = (osPriority_t) osPriorityNormal,
};

osThreadId_t ww_BLUE_taskHandle;
const osThreadAttr_t ww_blue_Task_attributes = {
		.name = "ww_blue",
		.stack_size = WW_STACK_CAPACITY,
		.priority = (osPriority_t) osPriorityNormal,
};

osThreadId_t LCD_manager_taskHandle;
const osThreadAttr_t LCD_manager_Task_attributes = {
		.name = "Lcd",
		.stack_size = 512 * 4,
		.priority = (osPriority_t) osPriorityNormal,
};

uint32_t ts_status = TS_OK;
osStatus_t message_status = osError;
TS_StateTypeDef  TS_State = {0};

osMessageQueueId_t thread_manager_message;

int APP_PAGE;
int prev_page;
#define FIB 0
#define GOL 1
#define WW 	2

#define GOL_STARTPOINT_X 250
#define GOL_STARTPOINT_Y 100
#define GOL_BOX_SIZE 360
#define GOL_CELL_SIZE 40
#define GOL_CELLS 9

#define MENU_HEIGHT 75
#define MENU_PANEL_WIDTH 267
#define STACK_VIEW_WIDTH 200
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_ETH_Init(void);
static void MX_FMC_Init(void);
static void MX_HDMI_CEC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C4_Init(void);
static void MX_IWDG_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI1_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC2_MMC_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM10_Init(void);
static void MX_TIM11_Init(void);
static void MX_TIM12_Init(void);
static void MX_UART5_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_USB_OTG_HS_PCD_Init(void);
static void MX_WWDG_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

