gabrijelokorn/stm32f769DISCO/EmbSys/Core/Src/main.c
						grid[y][x] = true;
				}

				if (TS_State.touchY[0] > 300 && TS_State.touchX[0] < STACK_VIEW_WIDTH) {
					GOL_running = false;
					osThreadTerminate(game_of_life_taskHandle);
				}
			}
		}


		osDelay(50);
	}
}

#define WW_BOX_X_START 	220
#define WW_BOX_Y_START 	100
#define WW_CELL_SIZE	40
#define WW_CELLS_X_AXIS	14
#define WW_CELLS_Y_AXIS	9

#define WW_BLACK 0
#define WW_YELLOW 1
#define WW_RED 2
#define WW_BLUE 3

#define MEM_BLOCK_SIZE_MUTEX WW_CELLS_X_AXIS * WW_CELLS_Y_AXIS * 1
uint8_t ww_map[WW_CELLS_Y_AXIS][WW_CELLS_X_AXIS];
uint8_t ww_map_prev[WW_CELLS_Y_AXIS][WW_CELLS_X_AXIS];
osTimerId_t timer_ww;
bool ww_step = false;

bool ww_red_finished = false;
bool ww_blue_finished = false;

osMutexId_t ww_mutex_id;
osStatus mutex_status;
const osMutexAttr_t ww_mutex = {
		"ww_mutex",
		osMutexPrioInherit,
		NULL,
		0
};

void ww_timer_func () {
	ww_step = true;
}

void ww_display_map() {

	for (int i = 0; i < WW_CELLS_Y_AXIS; i++) {
		for (int j = 0; j < WW_CELLS_X_AXIS; j++) {
			if (ww_map[i][j] == WW_BLACK) {
				BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			} else if (ww_map[i][j] == WW_YELLOW) {
				BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
			} else if (ww_map[i][j] == WW_RED) {
				BSP_LCD_SetTextColor(LCD_COLOR_RED);
			} else {
				BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
			}
			BSP_LCD_FillRect(WW_BOX_X_START + j * WW_CELL_SIZE + 1, WW_BOX_Y_START + i * WW_CELL_SIZE + 1, WW_CELL_SIZE - 1, WW_CELL_SIZE - 1);
		}
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

	if (ww_blue_finished && ww_red_finished) {
		ww_red_finished = false;
		ww_blue_finished = false;
	} else {
		return;
	}
	for (int i = 0; i < WW_CELLS_Y_AXIS; i++) {
		for (int j = 0; j < WW_CELLS_X_AXIS; j++) {
			// Only if all the processes were finished
			ww_map_prev[i][j] = ww_map[i][j];
		}
	}
}

void prepare_ww () {
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_FillRect(WW_BOX_X_START, WW_BOX_Y_START, WW_CELLS_X_AXIS * WW_CELL_SIZE, WW_CELLS_Y_AXIS * WW_CELL_SIZE);
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

	// draw horizontal lines
	for (int i = 0; i <= WW_CELLS_Y_AXIS; i++) {
		BSP_LCD_DrawHLine(WW_BOX_X_START, WW_BOX_Y_START + i * WW_CELL_SIZE, WW_CELLS_X_AXIS * WW_CELL_SIZE);
	}

	// draw vertical lines
	for (int i = 0; i <= WW_CELLS_X_AXIS; i++) {
		BSP_LCD_DrawVLine(WW_BOX_X_START + i * WW_CELL_SIZE, WW_BOX_Y_START, WW_CELLS_Y_AXIS * WW_CELL_SIZE);
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
}

void wireworld_t (void* args) {

	thread_info *ww_info = malloc(sizeof(thread_info));
	ww_info->pid = WW + 1;
	ww_info->sent_messages = 0;
	ww_info->stack_size = WW_STACK_CAPACITY;
	ww_info->time_running = 0;

	// Starting pattern
	ww_map[2][0] = WW_BLUE;
	ww_map[2][1] = WW_YELLOW;
	ww_map[2][2] = WW_YELLOW;
	ww_map[2][3] = WW_YELLOW;
	ww_map[2][4] = WW_YELLOW;
	ww_map[2][5] = WW_YELLOW;

	ww_map[3][6] = WW_YELLOW;
	ww_map[5][6] = WW_YELLOW;
	ww_map[4][5] = WW_YELLOW;
	ww_map[4][6] = WW_YELLOW;

	ww_map[6][0] = WW_YELLOW;
	ww_map[6][1] = WW_YELLOW;
	ww_map[6][2] = WW_YELLOW;
	ww_map[6][3] = WW_YELLOW;
	ww_map[6][4] = WW_YELLOW;
	ww_map[6][5] = WW_YELLOW;

	ww_map[4][7] = WW_YELLOW;
	ww_map[4][8] = WW_YELLOW;
	ww_map[4][9] = WW_YELLOW;
	ww_map[4][10] = WW_YELLOW;
	ww_map[4][11] = WW_YELLOW;
	ww_map[4][12] = WW_YELLOW;
	ww_map[4][13] = WW_YELLOW;

	ww_map[0][13] = WW_YELLOW;
	ww_map[1][13] = WW_YELLOW;
	ww_map[2][13] = WW_YELLOW;
	ww_map[3][13] = WW_YELLOW;
	ww_map[4][13] = WW_YELLOW;
	ww_map[5][13] = WW_YELLOW;
	ww_map[6][13] = WW_YELLOW;
	ww_map[7][13] = WW_YELLOW;
	ww_map[8][13] = WW_YELLOW;

	for (int i = 0; i < 14; i++) {
		ww_map[0][i] = WW_YELLOW;
		ww_map[8][i] = WW_YELLOW;
	}



	while(1) {

		if (APP_PAGE == WW) {
			int stack_space = osThreadGetStackSpace(wirewolrd_taskHandle);

			if (ww_step == true) {
				ww_display_map(ww_map);
				ww_step = false;
			}

			if (TS_State.touchX[0] > WW_BOX_X_START && TS_State.touchX[0] < WW_BOX_X_START + WW_CELLS_X_AXIS * WW_CELL_SIZE &&
				TS_State.touchY[0] > WW_BOX_Y_START && TS_State.touchY[0] < WW_BOX_Y_START + WW_CELLS_Y_AXIS * WW_CELL_SIZE) {
				uint16_t x = (TS_State.touchX[0] - WW_BOX_X_START) / WW_CELL_SIZE;
				uint16_t y = (TS_State.touchY[0] - WW_BOX_Y_START) / WW_CELL_SIZE;

				ww_map[y][x] = WW_YELLOW;
			}

			ww_info->stack_space = stack_space;
			if(osMessageQueuePut(thread_manager_message, &ww_info, 0, osWaitForever) == osOK) {
				ww_info->sent_messages += 1;
			}
		}

		osDelay(20);
	}
}

void ww_red_t () {
	while (1) {
		mutex_status = osMutexAcquire(ww_mutex_id, osWaitForever);
		if (mutex_status == osOK) {
			for (int i = 0; i < WW_CELLS_Y_AXIS; i++) {
				for (int j = 0; j < WW_CELLS_X_AXIS; j++) {

					if (ww_map_prev[i][j] == WW_BLUE) {
						ww_map[i][j] = WW_RED;
					}
					if (ww_map_prev[i][j] == WW_RED) {
						ww_map[i][j] = WW_YELLOW;
					}

				}
			}
			ww_red_finished = true;
		}
		osMutexRelease(ww_mutex_id);
		osDelay(20);
	}
}

void ww_blue_t () {
	while(1) {
		mutex_status = osMutexAcquire(ww_mutex_id, osWaitForever);
		if (mutex_status == osOK) {

			for (int i = 0; i < WW_CELLS_Y_AXIS; i++) {
				for (int j = 0; j < WW_CELLS_X_AXIS; j++) {

					uint8_t neigh = 0;
					// count neigbours
					if (ww_map_prev[i][j] == WW_YELLOW) {
						if (i > 0) {
							if (j > 0) {
								if (ww_map_prev[i - 1][j - 1] == WW_BLUE) neigh++; // 1 - levo gor
							}
							if (ww_map_prev[i - 1][j] == WW_BLUE) neigh++; // 2 - gor
							if (j < WW_CELLS_X_AXIS - 1) {
								if (ww_map_prev[i - 1][j + 1] == WW_BLUE) neigh++; // 3 - desno gor
							}
						}
						if (i < WW_CELLS_Y_AXIS - 1) {
							if (j > 0) {
								if (ww_map_prev[i + 1][j - 1] == WW_BLUE) neigh++; // 4 - levo dol
							}
							if (ww_map_prev[i + 1][j] == WW_BLUE) neigh++; // 5 - dol
							if (j < WW_CELLS_X_AXIS - 1) {
								if (ww_map_prev[i + 1][j + 1] == WW_BLUE) neigh++; // 6 - desno dol
							}
						}
						if (j > 0) {
								if (ww_map_prev[i][j - 1] == WW_BLUE) neigh++; // 7 - levo
						}
						if (j < WW_CELLS_X_AXIS - 1) {
								if (ww_map_prev[i][j + 1] == WW_BLUE) neigh++; // 8 - desno
						}

						if ((neigh == 1 || neigh == 2)) {
							ww_map[i][j] = WW_BLUE;
						}
					}
				}
			}
			ww_blue_finished = true;
		}
		osMutexRelease(ww_mutex_id);
		osDelay(20);
	}
}

void prepare_pages() {
	if (APP_PAGE == FIB) {
		BSP_LCD_SetTextColor(LCD_COLOR_DARKYELLOW);
		BSP_LCD_FillRect(STACK_VIEW_WIDTH, MENU_HEIGHT, BSP_LCD_GetXSize() - STACK_VIEW_WIDTH, BSP_LCD_GetYSize() - MENU_HEIGHT);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		fibonacci_prepare();
	} else if (APP_PAGE == GOL) {
		BSP_LCD_SetTextColor(LCD_COLOR_DARKGRAY);
		BSP_LCD_FillRect(STACK_VIEW_WIDTH, MENU_HEIGHT, BSP_LCD_GetXSize() - STACK_VIEW_WIDTH, BSP_LCD_GetYSize() - MENU_HEIGHT);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		prepare_gol();
	} else {
		BSP_LCD_SetTextColor(LCD_COLOR_DARKMAGENTA);
		BSP_LCD_FillRect(STACK_VIEW_WIDTH, MENU_HEIGHT, BSP_LCD_GetXSize() - STACK_VIEW_WIDTH, BSP_LCD_GetYSize() - MENU_HEIGHT);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		prepare_ww();
	}
}

void refresh_navigation() {
	if (prev_page != APP_PAGE) {
		BSP_LCD_DisplayStringAt(50, 20, (uint8_t*) "Fibonacci", LEFT_MODE);
		BSP_LCD_DisplayStringAt(300, 20, (uint8_t*) "Game of Life", LEFT_MODE);
		BSP_LCD_DisplayStringAt(580, 20, (uint8_t*) "Wireworld", LEFT_MODE);

		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
		if (APP_PAGE == FIB) {
			BSP_LCD_DisplayStringAt(50, 20, (uint8_t*) "Fibonacci", LEFT_MODE);
		} else if (APP_PAGE == GOL) {
			BSP_LCD_DisplayStringAt(300, 20, (uint8_t*) "Game of Life", LEFT_MODE);
		} else {
			BSP_LCD_DisplayStringAt(580, 20, (uint8_t*) "Wireworld", LEFT_MODE);
		}
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

		BSP_LCD_DisplayStringAt(10, 100, (uint8_t*) "           ", LEFT_MODE);
		BSP_LCD_DisplayStringAt(10, 130, (uint8_t*) "           ", LEFT_MODE);
		BSP_LCD_DisplayStringAt(10, 160, (uint8_t*) "           ", LEFT_MODE);
		BSP_LCD_DisplayStringAt(10, 190, (uint8_t*) "           ", LEFT_MODE);

