gabrijelokorn/stm32f769DISCO/EmbSys/Core/Src/main.c
		prepare_pages();
		prev_page = APP_PAGE;
	}
	osDelay(20);

}

void prepare_navigation() {
	BSP_LCD_DisplayStringAt(10, 100, (uint8_t*) "           ", LEFT_MODE);
	BSP_LCD_DisplayStringAt(10, 130, (uint8_t*) "           ", LEFT_MODE);
	BSP_LCD_DisplayStringAt(10, 160, (uint8_t*) "           ", LEFT_MODE);
	BSP_LCD_DisplayStringAt(10, 190, (uint8_t*) "           ", LEFT_MODE);
	BSP_LCD_DisplayStringAt(50, 20, (uint8_t*) "Fibonacci", LEFT_MODE);
	BSP_LCD_DisplayStringAt(300, 20, (uint8_t*) "Game of Life", LEFT_MODE);
	BSP_LCD_DisplayStringAt(580, 20, (uint8_t*) "Worldwire", LEFT_MODE);

	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
	if (APP_PAGE == FIB) {
	BSP_LCD_DisplayStringAt(50, 20, (uint8_t*) "Fibonacci", LEFT_MODE);
	} else if (APP_PAGE == GOL) {
	BSP_LCD_DisplayStringAt(300, 20, (uint8_t*) "Game of Life", LEFT_MODE);
	} else {
	BSP_LCD_DisplayStringAt(580, 20, (uint8_t*) "Worldwire", LEFT_MODE);
	}

	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

	prepare_pages();
}

void LCD_manager_t (void* args) {

	prepare_navigation();

	thread_info *received_message = malloc(sizeof(thread_info));

	while(1) {
		int number_of_active_threads = osThreadGetCount();
		int number_of_active_threads_strlen = integer_length(number_of_active_threads);
		char number_of_active_threads_str[number_of_active_threads_strlen];
		sprintf(number_of_active_threads_str, "Threads: %d", number_of_active_threads);
 		BSP_LCD_DisplayStringAt(10, 380, (uint8_t*) number_of_active_threads_str, LEFT_MODE);


		BSP_TS_GetState(&TS_State);
		if (TS_State.touchDetected > 0) {
			if (TS_State.touchY[0] < 75) {
				if (TS_State.touchX[0] < 267) {
					APP_PAGE = FIB;
				} else if (TS_State.touchX[0] > 267 && TS_State.touchX[0] < 533) {
					APP_PAGE = GOL;
				} else {
					APP_PAGE = WW;
				}
			}
		}
		refresh_navigation();

		// stack view
		osMessageQueueGet(thread_manager_message, &received_message, NULL, osWaitForever);

		int pid = received_message->pid;
		int pid_strlen = integer_length(pid);
		char PID[] = "PID";
		char pid_str[strlen(PID) + pid_strlen];
		sprintf(pid_str, "%s:%d", PID, pid);
		BSP_LCD_DisplayStringAt(10, 100, (uint8_t*) pid_str, LEFT_MODE);

		int stack_space = received_message->stack_space;
		int stack_space_strlen = integer_length(stack_space);
		char stack_sp[] = "Unused";
		char stack_space_str[strlen(stack_sp) + stack_space_strlen];
		sprintf(stack_space_str, "%s:%04d", stack_sp, stack_space);
		BSP_LCD_DisplayStringAt(10, 130, (uint8_t*) stack_space_str, LEFT_MODE);

		int stack_size = received_message->stack_size;
		int stack_size_strlen = integer_length(stack_size);
		char stack_si[] = "Size";
		char stack_size_str[strlen(stack_si) + stack_size_strlen];
		sprintf(stack_size_str, "%s:%04d", stack_si, stack_size);
		BSP_LCD_DisplayStringAt(10, 160, (uint8_t*) stack_size_str, LEFT_MODE);

		int sent_messages = received_message->sent_messages;
		int sent_messages_strlen = integer_length(sent_messages);
		char MSG[] = "MSG";
		char sent_messages_str[strlen(MSG) + sent_messages_strlen];
		sprintf(sent_messages_str, "%s:%04d", MSG, sent_messages);
		BSP_LCD_DisplayStringAt(10, 190, (uint8_t*) sent_messages_str, LEFT_MODE);

		osDelay(50);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	extern int APP_PAGE;
	APP_PAGE = FIB;
	prev_page = APP_PAGE;


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

/* Configure the peripherals common clocks */
//  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* USER CODE BEGIN 2 */

	GPIO_InitTypeDef gumb_a;
	gumb_a.Pin = GPIO_PIN_0;
	gumb_a.Mode = GPIO_MODE_IT_RISING;
	gumb_a.Pull = GPIO_NOPULL;
	gumb_a.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &gumb_a);

	HAL_NVIC_SetPriority(EXTI0_IRQn, 1, 2);
	HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);

  ts_status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
  while(ts_status != TS_OK);

  ts_status = BSP_TS_ITConfig();
  while(ts_status != TS_OK);

  BSP_TS_INT_MspInit();

	BSP_LCD_Clear(LCD_COLOR_DARKCYAN);
	BSP_LCD_DrawVLine(MENU_PANEL_WIDTH, 0, MENU_HEIGHT);
	BSP_LCD_DrawVLine(2 * MENU_PANEL_WIDTH, 0, MENU_HEIGHT);

	BSP_LCD_DrawHLine(0, MENU_HEIGHT, BSP_LCD_GetXSize());
	BSP_LCD_DrawVLine(STACK_VIEW_WIDTH, MENU_HEIGHT, BSP_LCD_GetYSize() - MENU_HEIGHT);

	BSP_LCD_FillRect(0, 300, STACK_VIEW_WIDTH, BSP_LCD_GetYSize());

  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  ww_mutex_id = osMutexNew(&ww_mutex);
  if (ww_mutex_id == NULL) {
	  while(1) {};
  }
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  timer_gol = osTimerNew(gol_timer_func, osTimerPeriodic, NULL, NULL);
  if (timer_gol != NULL) {
	  osTimerStart(timer_gol, 500);
  }
  timer_ww = osTimerNew(ww_timer_func, osTimerPeriodic, NULL, NULL);
  if (timer_ww != NULL) {
	  osTimerStart(timer_ww, 500);
  }
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  thread_manager_message = osMessageQueueNew(5, sizeof(thread_info), NULL);
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of defaultTask */
//  defaultTaskHandle = osThreadNew(StartDefaultTask, NULL, &defaultTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
	fibonacci_taskHandle = osThreadNew(fibonacci_t, NULL, &fibonacci_Task_attributes);
	game_of_life_taskHandle = osThreadNew(game_of_life_t, NULL, &game_of_life_Task_attributes);
	wirewolrd_taskHandle = osThreadNew(wireworld_t, NULL, &wirewolrd_Task_attributes);
	ww_RED_taskHandle = osThreadNew(ww_red_t, NULL, &ww_red_Task_attributes);
	ww_BLUE_taskHandle = osThreadNew(ww_blue_t, NULL, &ww_blue_Task_attributes);
	LCD_manager_taskHandle = osThreadNew(LCD_manager_t, NULL, &LCD_manager_Task_attributes);
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();


  /* We should never get here as control is now taken by the scheduler */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

